<?php
namespace Ecrawler\SiteCrawler;
interface SiteCrawler {
    const CACHE_DIR = "/Crawl_Data/cache/";
    const FLAG_DIR = "/www/sns/batch/flag/";
    const NO_SCRAP_ITEM_XPATH = "-";
    const CRAWLER_CONFIG = [
            'useragent' => 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.143 Safari/537.36'
        ];
    public function getUrlList();
    public function scrapContent();
    const PREFECTURE_LIST = 
        array (
            '北海道'=>['tan'=>'北海道', 'id'=>1, 'kana'=>'ホッカイドウ'],
            '青森県'=>['tan'=>'青森', 'id'=>2, 'kana'=>'アオモリケン'],
            '岩手県'=>['tan'=>'岩手', 'id'=>3, 'kana'=>'イワテケン'],
            '宮城県'=>['tan'=>'宮城', 'id'=>4, 'kana'=>'ミヤギケン'],
            '秋田県'=>['tan'=>'秋田', 'id'=>5, 'kana'=>'アキタケン'],
            '山形県'=>['tan'=>'山形', 'id'=>6, 'kana'=>'ヤマガタケン'],
            '福島県'=>['tan'=>'福島', 'id'=>7, 'kana'=>'フクシマケン'],
            '茨城県'=>['tan'=>'茨城', 'id'=>8, 'kana'=>'イバラキケン'],
            '栃木県'=>['tan'=>'栃木', 'id'=>9, 'kana'=>'トチギケン'],
            '群馬県'=>['tan'=>'群馬', 'id'=>10, 'kana'=>'グンマケン'],
            '埼玉県'=>['tan'=>'埼玉', 'id'=>11, 'kana'=>'サイタマケン'],
            '千葉県'=>['tan'=>'千葉', 'id'=>12, 'kana'=>'チバケン'],
            '東京都'=>['tan'=>'東京', 'id'=>13, 'kana'=>'トウキョウト'],
            '神奈川県'=>['tan'=>'神奈川', 'id'=>14, 'kana'=>'カナガワケン'],
            '新潟県'=>['tan'=>'新潟', 'id'=>15, 'kana'=>'ニイガタケン'],
            '富山県'=>['tan'=>'富山', 'id'=>16, 'kana'=>'トヤマケン'],
            '石川県'=>['tan'=>'石川', 'id'=>17, 'kana'=>'イシカワケン'],
            '福井県'=>['tan'=>'福井', 'id'=>18, 'kana'=>'フクイケン'],
            '山梨県'=>['tan'=>'山梨', 'id'=>19, 'kana'=>'ヤマナシケン'],
            '長野県'=>['tan'=>'長野', 'id'=>20, 'kana'=>'ナガノケン'],
            '岐阜県'=>['tan'=>'岐阜', 'id'=>21, 'kana'=>'ギフケン'],
            '静岡県'=>['tan'=>'静岡', 'id'=>22, 'kana'=>'シズオカケン'],
            '愛知県'=>['tan'=>'愛知', 'id'=>23, 'kana'=>'アイチケン'],
            '三重県'=>['tan'=>'三重', 'id'=>24, 'kana'=>'ミエケン'],
            '滋賀県'=>['tan'=>'滋賀', 'id'=>25, 'kana'=>'シガケン'],
            '京都府'=>['tan'=>'京都', 'id'=>26, 'kana'=>'キョウトフ'],
            '大阪府'=>['tan'=>'大阪', 'id'=>27, 'kana'=>'オオサカフ'],
            '兵庫県'=>['tan'=>'兵庫', 'id'=>28, 'kana'=>'ヒョウゴケン'],
            '奈良県'=>['tan'=>'奈良', 'id'=>29, 'kana'=>'ナラケン'],
            '和歌山県'=>['tan'=>'和歌山', 'id'=>30, 'kana'=>'ワカヤマケン'],
            '鳥取県'=>['tan'=>'鳥取', 'id'=>31, 'kana'=>'トットリケン'],
            '島根県'=>['tan'=>'島根', 'id'=>32, 'kana'=>'シマネケン'],
            '岡山県'=>['tan'=>'岡山', 'id'=>33, 'kana'=>'オカヤマケン'],
            '広島県'=>['tan'=>'広島', 'id'=>34, 'kana'=>'ヒロシマケン'],
            '山口県'=>['tan'=>'山口', 'id'=>35, 'kana'=>'ヤマグチケン'],
            '徳島県'=>['tan'=>'徳島', 'id'=>36, 'kana'=>'トクシマケン'],
            '香川県'=>['tan'=>'香川', 'id'=>37, 'kana'=>'カガワケン'],
            '愛媛県'=>['tan'=>'愛媛', 'id'=>38, 'kana'=>'エヒメケン'],
            '高知県'=>['tan'=>'高知', 'id'=>39, 'kana'=>'コウチケン'],
            '福岡県'=>['tan'=>'福岡', 'id'=>40, 'kana'=>'フクオカケン'],
            '佐賀県'=>['tan'=>'佐賀', 'id'=>41, 'kana'=>'サガケン'],
            '長崎県'=>['tan'=>'長崎', 'id'=>42, 'kana'=>'ナガサキケン'],
            '熊本県'=>['tan'=>'熊本', 'id'=>43, 'kana'=>'クマモトケン'],
            '大分県'=>['tan'=>'大分', 'id'=>44, 'kana'=>'オオイタケン'],
            '宮崎県'=>['tan'=>'宮崎', 'id'=>45, 'kana'=>'ミヤザキケン'],
            '鹿児島県'=>['tan'=>'鹿児島', 'id'=>46, 'kana'=>'カゴシマケン'],
            '沖縄県'=>['tan'=>'沖縄', 'id'=>47, 'kana'=>'オキナワケン'],
        );
}